{"type":"data","nodes":[{"type":"data","data":[{}],"uses":{}},{"type":"data","data":[{"projects":1},[2,33,46,78,103,131,154,177],{"order":3,"title":4,"status":5,"value":6,"beneficiary":7,"shortDescription":8,"longDescription":9,"impact":10,"extraContent":11,"linkText":12,"extraContentLinkText":11,"launchDate":13,"image":14,"tools":15,"timeSaved":19,"moneySaved":11,"likes":27,"follows":28,"show":29,"beforeImpact":11,"afterImpact":11,"created_at":30,"extraContentTitle":11,"id":31,"anchor":32},8,"Discharge | News Headline Neutralizer","completed","sanity","personal","Rewrite news in a neutral tone","Discharge is the opposite of this \u003Ca href=\"https://www.youtube.com/watch?v=ZJMGS7l0wT8\" target=\"_blank\">old Geico commercial from 2006\u003C/a>.\n\nNews headlines exploit our natural wiring and hijack our attention through negative, alarming, and partisan framing. It's rare that I don't feel drained and agitated after reading the news.\n\nTo reclaim my sanity, I built Discharge, a Chrome extension that automatically rewrites news headlines in a bland tone while preserving the original site's styling and layout. It allows me to enjoy a natural reading experience—same information but without the anxiety.\n\nI put this simple tool together in about two hours, and it's made browsing the news so much more pleasant!\n\nNote: Since Discharge is customized for my personal use, it works for the New York Times only.",false,null,"Follow for updates >","2025-04-27T20:45:00.000Z","news.gif",[16,17,18],"Chrome Extension API","MutationObserver API","Anthropic API",{"daily":20,"hasCalculator":10,"alternativeUses":21},0,[22,23,24,25,26],"reduce daily anxiety levels","maintain better emotional balance","make more rational decisions","improve sleep quality","develop a more balanced worldview",5,3,true,"2025-04-02T21:56:04.961468+00:00","7f2bc773-22db-4233-b6f8-622a31dba833","discharge",{"order":34,"title":35,"status":5,"value":36,"beneficiary":7,"shortDescription":37,"longDescription":38,"impact":10,"extraContent":11,"linkText":11,"extraContentLinkText":11,"launchDate":39,"image":40,"tools":41,"timeSaved":11,"moneySaved":11,"likes":27,"follows":20,"show":29,"beforeImpact":11,"afterImpact":11,"created_at":43,"extraContentTitle":11,"id":44,"anchor":45},7,"Sunny | Voice Agent to Inspire Personal Projects","insight","AI agent to help you think of time-saving opportunities","Most people have something they wish they could do more of and something they wish they could do less of. Once they identify what those things are, they can begin to think about how to actually shift their time allocation.\n\nSunny is an AI voice agent designed to help people see recalibration possibilities in their existing patterns, which may then spark project ideas. Talking to Sunny is simple and takes just five minutes.\n\nIf you've never spoken with an AI voice agent before, \u003Ca href=\"/sunny\">today could be the day\u003C/a>.","2025-04-18T21:00:00.000Z","sunny.gif",[42],"VAPI","2025-04-19T11:49:32.770005+00:00","fb7989d3-6d9b-46ed-a6db-0f3f37597441","sunny",{"order":47,"title":48,"status":5,"value":49,"beneficiary":50,"shortDescription":51,"longDescription":52,"impact":29,"extraContent":53,"linkText":54,"extraContentLinkText":55,"launchDate":56,"image":57,"tools":58,"timeSaved":11,"moneySaved":66,"likes":27,"follows":20,"show":29,"beforeImpact":11,"afterImpact":11,"created_at":74,"extraContentTitle":75,"id":76,"anchor":77},6,"Miss Penny | Daily 8 AM Text to Track Expenses Against Budget","money","household","Daily text to track expenses against budget","Every month, despite promises to spend more mindfully, our family kept blowing the budget on restaurants and impulse Amazon purchases. One reason was because we lacked real-time insight into our spending habits.\n\nMiss Penny fixes this by sending a daily 8 AM text showing exactly how we're tracking against our dining out and shopping budgets.\n\nSo far, the daily text messages have helped us reduce expenses by $262 a month on average, even after tarrifs! (I update this figure monthly.)","Miss Penny only accounts for posted transactions, not pending ones, so the data in the daily text messages lags by two or three days. This limitation comes from Tiller Money, the tool Miss Penny relies on. One way around it would be to reconfigure Miss Penny to use a different service, like Plaid.","Impact calculator >","What to improve >","2025-02-01T05:00:00.000Z","miss-penny.gif",[59,60,61,62,63,64,65],"GitHub Actions","Google Apps Script","Google Sheets","OpenAI API","Python","Sheet SMS","Tiller Money",{"daily":67,"hasCalculator":10,"alternativeUses":68},8.61,[69,70,71,72,73],"commission two life-size ice sculptures.","feed 250 people a large burrito each.","buy an original Dali print.","donate 200 board games to a community center.","rent a giant billboard in Times Square for 7 minutes.","2025-04-02T21:56:03.816299+00:00","Data delay","687545cd-387d-4631-bc6d-f77fe3cf23e9","miss-penny",{"order":27,"title":79,"status":5,"value":80,"beneficiary":7,"shortDescription":81,"longDescription":82,"impact":10,"extraContent":11,"linkText":83,"extraContentLinkText":11,"launchDate":56,"image":84,"tools":85,"timeSaved":11,"moneySaved":92,"likes":27,"follows":20,"show":29,"beforeImpact":11,"afterImpact":11,"created_at":100,"extraContentTitle":11,"id":101,"anchor":102},"Weekend Projects | This Website","fun","Project portfolio","I needed a personal website to synthesize my excitement around AI-assisted software development. Webflow used to be my go-to tool for building websites. However, I was not patient enough to dig deep into its knowledge base to pull off the elaborate tricks needed to customize the things I wanted to customize. Plus, Webflow would've cost me $300/year for the features I needed.\n\nI ended up building this website from scratch with Cursor. I got to implement real-time calculators, custom sliders, a database, and even AI voice agent integration. I also became familiar with Svelte, a framework previously completely foreign to me. And my hosting cost is zero!","See impact >","wp.gif",[86,87,88,89,90,91],"EmailJS","FormSubmit","GitHub Pages","Supabase","SvelteKit","Vite",{"daily":93,"hasCalculator":10,"alternativeUses":94},5.5,[95,96,97,98,99],"buy a high-end camera","take a weekend trip to a nearby city","upgrade your computer","get a year's worth of streaming services","eat at 10 nice restaurants","2025-04-02T21:56:03.966473+00:00","430d7273-7014-4450-a786-51fcda8d9230","wp",{"order":104,"title":105,"status":5,"value":6,"beneficiary":50,"shortDescription":106,"longDescription":107,"impact":29,"extraContent":108,"linkText":83,"extraContentLinkText":109,"launchDate":110,"image":111,"tools":112,"timeSaved":117,"moneySaved":11,"likes":27,"follows":20,"show":29,"beforeImpact":125,"afterImpact":126,"created_at":127,"extraContentTitle":128,"id":129,"anchor":130},4,"Expeditr | Consolidate Recipe URLs Into One Ingredient List","Consolidate recipe URLs into one ingredient list","Meal planning used to be mind-numbingly tedious for our family. We would juggle multiple browser tabs for recipes while searching for ingredients on FreshDirect, often having to add common items, like lemons, multiple times.\n\nI built \u003Ca href=\"https://expeditr.onrender.com/\" target=_blank>Expeditr\u003C/a> to simplify our workflow. It automatically converts up to 10 recipe URLs into one ingredient list, organized by category.\n\nIt uses an LLM to smartly consolidate ingredients listed under different names (like \"scallions\" and \"spring onions\") and combine different measurement units into single, sensible quantities. It categorizes pantry items separately, helping us identify ingredients we likely already have at home.","Our ideal workflow is one where we input recipe URLs and get a loaded FreshDirect shopping cart as the output. But since FreshDirect doesn't have an open API, automated shopping is still difficult to build. I considered using web browsing automation, like Puppeteer, plus an LLM to pick items and load the cart—but it’ll probably be too clunky and unreliable. Instacart, a FreshDirect competitor, does have an open API, so I may look into working with it.","What's still missing >","2024-11-10T05:00:00.000Z","expeditr.gif",[18,113,114,115,116],"Node.js","Python + Flask","React + Vite","Render",{"weekly":118,"hasCalculator":29,"alternativeUses":119},30,[120,121,122,123,124],"prepare for a presentation","do a yoga session","call an old friend","take a relaxing bath","meditate for stress relief","We used to procrastinate on meal planning because we dreaded the unpleasant process. We would then run out of ingredients and be forced to order takeout.\n\nOur takeout portions usually didn't leave enough leftovers for next day's lunch. This forced us into another round of takeout orders. The takeout domino effect made us spend more money and eat less healthy than we should.","Because meal planning is now significantly more pleasant, it's easier for us to stay on schedule and keep our refrigerator well-stocked.\n\nWe've cut our takeout spending substantially, enjoy healthier eating habits, and appreciate better-tasting meals throughout the week. The simple removal of one painful part has improved both our diet and our budget.","2025-04-02T21:56:03.626057+00:00","Automated shopping next","938fc7ac-cb7a-49e7-aa10-45c95f091552","expeditr",{"order":28,"title":132,"status":5,"value":133,"beneficiary":134,"shortDescription":135,"longDescription":136,"impact":29,"extraContent":11,"linkText":54,"extraContentLinkText":11,"launchDate":137,"image":138,"tools":139,"timeSaved":141,"moneySaved":11,"likes":104,"follows":20,"show":29,"beforeImpact":149,"afterImpact":150,"created_at":151,"extraContentTitle":11,"id":152,"anchor":153},"Parse Emails and Turn Them Into a Database","time","work/business","Parse emails and turn them into a database","A tennis club's after-school program needed digital streamlining: applications arrived via email, were printed and filed, and the director had to manage from hard copies or manually enter data into spreadsheets.\n\nI used Google Apps Script to automate the transfer of application data into Google Sheets, organizing students by semester, tracking dismissal times and transportation, managing staff assignments, and storing contact details.\n\nThis saved the program director about an hour per week.","2024-08-14T04:00:00.000Z","jdp.gif",[60,140],"Google Sheets API",{"weekly":142,"hasCalculator":29,"alternativeUses":143},60,[144,145,146,147,148],"become a proficient ukulele player.","run 11 marathons at a moderate pace.","build a bench for the entryway.","write a children's book.","create a small garden.","The director managed applications manually from hard copies.","Data is now automatically transferred to Google Sheets.","2025-04-02T21:56:03.445605+00:00","617d6521-64fd-4d99-ad5e-5b3ea85a50d6","junior-program-workflow",{"order":155,"title":156,"status":5,"value":36,"beneficiary":134,"shortDescription":157,"longDescription":158,"impact":29,"extraContent":11,"linkText":159,"extraContentLinkText":11,"launchDate":160,"image":161,"tools":162,"timeSaved":164,"moneySaved":11,"likes":27,"follows":20,"show":29,"beforeImpact":172,"afterImpact":173,"created_at":174,"extraContentTitle":11,"id":175,"anchor":176},2,"Custom Google Calendar Integration","Custom Google Calendar integration","At a local tennis club, instructors had to resort to an inconvenient method of checking their lesson schedules: they had to call the front desk several times a day. This was because the club's scheduling web app was poorly designed for mobile viewing. The frequent calls were not only tedious for the instructors but also frustrating for the front desk staff who needed to focus on serving club members.\n\nTo solve this problem, I created a web scraper that extracts lesson schedules and court assignments from the club's web app, filters them by instructor, and posts them directly to Google Calendar. This integration transforms club-level lesson schedules into a personalized, mobile-friendly calendar view. \n\nInstructors now have immediate access to their schedules anytime, anywhere. The solution not only improved instructor organization but also allowed front desk staff to refocus on member service, resolving a point of tension.","User impact >","2024-08-06T04:00:00.000Z","joe-calendar.gif",[163,113],"Google Calendar API",{"daily":165,"hasCalculator":29,"alternativeUses":166},15,[167,168,169,170,171],"eat 72 extra meals.","get 182 foot massages.","fly around the world twice.","read 15 books.","explore 30 museums.","One instructor tracked his lessons primarily through memory and frequent phone calls to the front desk. With visibility limited to only the next day or two, he operated in a perpetual short-term planning cycle. This made it difficult to coordinate personal activities with his work schedule or plan effectively with others.\n\nHe had previously attempted to centralize his calendar by writing personal appointments directly onto the physical court sheet at the club, creating a makeshift master calendar. This solution was suboptimal, as he could only access the calendar when physically present at the club, leaving him disconnected from his schedule whenever he was away.","With his schedule now automatically synced to his phone, this instructor gained complete weekly visibility at a glance.\n\nBeyond saving time, the solution sparked an unexpected transformation in his organizational habits. He began using the calendar app comprehensively for personal appointments, family events, and even tracking his wife's schedule.\n\nWhat started as a simple work tool became a catalyst for improved time management across his life.","2025-04-02T21:56:03.2597+00:00","1199dab7-2bdf-4874-80aa-0cdf721b78a3","pro-lesson-calendars",{"order":178,"title":179,"status":5,"value":133,"beneficiary":134,"shortDescription":180,"longDescription":181,"impact":29,"extraContent":11,"linkText":54,"extraContentLinkText":11,"launchDate":182,"image":183,"tools":184,"timeSaved":185,"moneySaved":11,"likes":104,"follows":20,"show":29,"beforeImpact":192,"afterImpact":193,"created_at":194,"extraContentTitle":11,"id":195,"anchor":196},1,"Web Scraper + Email Notification","Web scraper + email notification","My tennis video company's workflow requires constant monitoring of tennis club court schedules to determine when to send videos, which courts they're from, and who should receive them. This process used to require manual checks several times daily.\n\nI built a web scraper to automate this entirely, sending updates to Google Sheets and triggering email notifications as needed.\n\nThis solution saves me 15 minutes a day. It eliminates a small but significant cognitive load from my day, allowing me uninterrupted focus on other work and personal time.","2024-05-10T04:00:00.000Z","scraper.gif",[140,113],{"daily":165,"hasCalculator":29,"alternativeUses":186},[187,188,189,190,191],"take 22 hiking trips.","play 60 tennis matches.","walk from Las Vegas to Mexico.","watch Stranger Things seasons 1-3 4x.","drive from NYC to LA and back.","Before using the web scraper, I had to manually check schedules several times a day.","After implementing the web scraper, the process is automated, saving me 15 minutes daily.","2025-04-02T21:56:03.042604+00:00","fdf925bc-0892-478d-94f5-651626922b26","ocams-notifier"],"uses":{}}]}
